Basketball Birthday Paradox

In [21]:
#Birthday Paradox Function
def birthday_probability(n):
    pass

In [22]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

In [23]:
#NBA Paradox Analysis
df = pd.read_csv('../Data/basketball_players.csv')
df.drop(columns = ['year_start', 'year_end', 'height', 'weight'], inplace = True)

In [24]:
df.head()

,name,position,birth_date,college
0,Alaa Abdelnaby,F-C,"June 24, 1968",Duke University
1,Zaid Abdul-Aziz,C-F,"April 7, 1946",Iowa State University
2,Kareem Abdul-Jabbar,C,"April 16, 1947","University of California, Los Angeles"
3,Mahmoud Abdul-Rauf,G,"March 9, 1969",Louisiana State University
4,Tariq Abdul-Wahad,F,"November 3, 1974",San Jose State University

In [25]:
#Convert birth_date to datetime type
df['birth_date'] = pd.to_datetime(df['birth_date'], format = '%B %d, %Y')

In [26]:
df.loc[df['college'].isnull()]

                          name position birth_date college
9                 Alex Abrines      G-F 1993-08-01     NaN
32               Alexis Ajinca        C 1988-05-06     NaN
38              Furkan Aldemir      F-C 1991-08-09     NaN
74              David Andersen        C 1980-06-23     NaN
100   Martynas Andriuskevicius        C 1986-03-12     NaN
...                        ...      ...        ...     ...
4529                   Sun Yue        G 1985-11-06     NaN
4540               Wang Zhizhi        C 1977-07-08     NaN
4544               Paul Zipser      G-F 1994-02-18     NaN
4545                Ante Zizic      F-C 1997-01-04     NaN
4548               Ivica Zubac        C 1997-03-18     NaN

[302 rows x 4 columns]

In [27]:
df['college'].fillna('None')

0                             Duke University
1                       Iowa State University
2       University of California, Los Angeles
3                  Louisiana State University
4                   San Jose State University
                        ...
4545                                     None
4546                    Kent State University
4547                      Duquesne University
4548                                     None
4549             George Washington University
Name: college, Length: 4550, dtype: object

In [28]:
df.head()

,name,position,birth_date,college
0,Alaa Abdelnaby,F-C,1968-06-24,Duke University
1,Zaid Abdul-Aziz,C-F,1946-04-07,Iowa State University
2,Kareem Abdul-Jabbar,C,1947-04-16,"University of California, Los Angeles"
3,Mahmoud Abdul-Rauf,G,1969-03-09,Louisiana State University
4,Tariq Abdul-Wahad,F,1974-11-03,San Jose State University

In [32]:
df.groupby('college')['college'].value_counts().sort_values(ascending = False)

college
University of Kentucky                   99
University of California, Los Angeles    91
University of North Carolina             87
University of Kansas                     72
Duke University                          71
                                         ..
Northwood Institute                       1
Ohio Wesleyan University                  1
Okaloosa-Walton Community College         1
Alabama - Huntsville                      1
Youngstown State University               1
Name: count, Length: 473, dtype: int64